Revit 2027 API
ScheduleField.GetCustomFieldData Method
 Gets the data associated with this custom field. If this field isn't a CustomField will return null.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CustomFieldData GetCustomFieldData()
Public Function GetCustomFieldData As CustomFieldData
public:
CustomFieldData^ GetCustomFieldData()
member GetCustomFieldData : unit -> CustomFieldData
Return Value
CustomFieldData
 Returns the data associated with this custom field. If this field isn't a CustomField will return null.
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace